# Напишите программу, которая на вход принимает текст и выводит количество уникальных символов.

s = input("Input some text: ")
print(len(set(s)))